benchmarks/artillery-different-workflows.yaml
config:
  target: 'unused' # required but not used
  processor: './parallel-different-workflow.js'
  phases:
    - name: 'Phase 1'
      arrivalRate: 1
      rampTo: 1500 
      maxVusers: 1500
      duration: 120
    # - pause: 2 # 5-second   pause phase
    # - name: 'Run'
    #   arrivalRate: 3000
    #   duration: 1
    #   maxVusers: 2000  # Higher concurrency for peak load
scenarios:
  - name: 'Run SDK Workflow'
    flow:
      - function: 'runWorkflow'